# parameters
nc: 5  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  # 未添加动物类别前
  # - [8,13, 8,20, 29,31]  # P3/8
  # - [18,54, 50,53, 37,110]  # P4/16
  # - [82,98, 178,190, 189,223]  # P5/32
  
  # 0609添加动物类别
  - [4,6, 7,8, 13,12]  # P3/8
  - [8,19, 11,19, 36,30]  # P4/16
  - [24,53, 66,57, 128,102]  # P5/32
  
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32
  # - [4,5, 8,8, 6,16]  # P3/8
  # - [14,12, 23,19, 19,41]  # P4/16
  # - [40,30, 63,57, 130,101]  # P5/32


# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   # [-1, 1, TransConv, [512, 2, 2]],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   # [-1, 1, TransConv, [256, 2, 2]],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3  16

   [-1, 3, C3, [256, False]],
   [-1, 1, Conv, [128, 1, 1]],

#   [2, 3, C3, [128]],
   [2, 1, nn.MaxPool2d, [2]],
   [[-1, 18], 1, Concat, [1]], # 19
   [-1, 3, C3, [256, False]],
   [-1, 1, Conv, [128, 1, 1]],

#   [0, 3, C3, [64]],
   [0, 1, nn.MaxPool2d, [2]],
   [-1, 1, nn.MaxPool2d, [2]],
   [-1, 1, Conv, [256, 1, 1]],
   [[-1, 21], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 3, C3, [256, False]],  # 27 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 30 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 33 (P5/32-large)

   [[27, 30, 33], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
