# Parameters
nc: 5  # 5个类别
depth_multiple: 0.33
width_multiple: 0.5

# 修改输入通道数
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2 (6x6 kernel for 4ch input)
  #  [-1, 1, Focus, [64, 4]],  # 0-P1/2 更高效的特征提取
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, HighEfficiencyFeatureDownSample, [64, 256]],  # 3-P3/8 使用高效特征下采样
   [-1, 3, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 1, BasicRFB, [256, 256]],  # 6 增加RFB模块扩大感受野
   [-1, 2, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 8-P5/32
   [-1, 1, CBAM, [1024]],  # 9 添加注意力机制
   [-1, 1, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 11
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 15
   [-1, 1, CBAM, [512]],  # 16 添加注意力机制增强特征

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 20
   
   [-1, 1, BasicRFB, [128, 128]],  # 21 增加RFB增强特征

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 24

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 27

  #  [[21, 24, 27], 1, SelfAdaptiveFusion, [512, 512]],  # 28 使用自适应融合替换简单连接
   [[21, 24, 27], 1, Detect, [nc, anchors]],  # 29 Detect
  ]
