# Parameters
nc: 5  # 5个类别
depth_multiple: 0.33  # 降低层数重复度
width_multiple: 0.375  # 进一步减少通道数 (从0.5降低)

anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  [[-1, 1, Focus, [32, 3]],  # 0-P1/2 使用Focus替代初始卷积，减小通道数
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4
   [-1, 2, C3Ghost, [64]],     # 2 使用Ghost模块，减少2个模块
   [-1, 1, GhostConv, [128, 3, 2]],  # 3-P3/8 使用Ghost卷积
   [-1, 3, C3Ghost, [128]],    # 4 
   [-1, 1, GhostConv, [256, 3, 2]],  # 5-P4/16
   [-1, 1, LiteRFB, [128, 128]],  # 6 轻量级RFB
   [-1, 2, C3Ghost, [256]],    # 7 减少模块数
   [-1, 1, GhostConv, [512, 3, 2]],  # 8-P5/32
   [-1, 1, ECAAttention, [256]],  # 9 使用轻量ECA注意力
   [-1, 1, C3Ghost, [512]],    # 10
   [-1, 1, SPPF, [512, 5]],   # 11 减小输出通道
  ]

head:
  [[-1, 1, GhostConv, [256, 1, 1]],  # 12 所有卷积替换为Ghost卷积
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # 13 连接点调整
   [-1, 2, C3Ghost, [256, False]],  # 14 减少模块数
   [-1, 1, ECAAttention, [128]],  # 15 ECA注意力

   [-1, 1, GhostConv, [128, 1, 1]],  # 16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # 18
   [-1, 2, C3Ghost, [128, False]],  # 19
   
   [-1, 1, LiteRFB, [64, 64]],  # 20 轻量级RFB

   [-1, 1, GhostConv, [128, 3, 2]],  # 21
   [[-1, 15], 1, Concat, [1]],  # 22 调整连接点
   [-1, 2, C3Ghost, [256, False]],  # 23

   [-1, 1, GhostConv, [256, 3, 2]],  # 24
   [[-1, 11], 1, Concat, [1]],  # 25
   [-1, 2, C3Ghost, [512, False]],  # 26

   [[20, 23, 26], 1, Detect, [nc, anchors]],  # 27 精简检测头
  ]