# Parameters
nc: 5  # 5个类别
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2 (6x6 kernel for 4ch input)
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C3, [128]],
  #  [-1, 1, CBAM, [128]],          # 添加CBAM但不改变通道数
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8
   [-1, 3, C3, [256]],
   [-1, 1, CBAM, [256]],          # 添加CBAM但不改变通道数
   [-1, 1, Conv, [512, 3, 2]],    # 6-P4/16
   [-1, 3, C3, [512]],
   [-1, 1, CBAM, [512]],          # 添加CBAM但不改变通道数
   [-1, 1, Conv, [1024, 3, 2]],   # 9-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, CBAM, [1024]],         # 添加CBAM但不改变通道数
   [-1, 1, SPPF, [1024, 5]],      # 12
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],                    # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 14
   [[-1, 8], 1, Concat, [1]],                     # 15 cat backbone P4
   [-1, 3, C3, [512, False]],                     # 16

   [-1, 1, Conv, [256, 1, 1]],                    # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 18
   [[-1, 5], 1, Concat, [1]],                     # 19 cat backbone P3
   [-1, 3, C3, [256, False]],                     # 20 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],                    # 21
   [[-1, 16], 1, Concat, [1]],                    # 22 cat head P4
   [-1, 3, C3, [512, False]],                     # 23 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                    # 24
   [[-1, 13], 1, Concat, [1]],                    # 25 cat head P5
   [-1, 3, C3, [1024, False]],                    # 26 (P5/32-large)

   [[20, 23, 26], 1, Detect, [nc, anchors]],      # 27 Detect(P3, P4, P5)
  ]
