# Parameters
nc: 5  # 修改为5个类别
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],      # 0-P1/2 (6x6 kernel for 4ch input)
   
   [-1, 1, HighEfficiencyFeatureDownSample, [128]],  # 1-P2/4 替换原Conv层
   [-1, 3, C3, [128]],
   [-1, 1, CBAM, [128]],               # 2-添加注意力机制
   
   [-1, 1, BasicRFB, [256]],           # 3-P3/8 添加感受野增强
   [-1, 3, C3, [256]],
   [-1, 1, CBAM, [256]],               # 5-添加注意力机制
   
   [-1, 1, BasicRFB, [512]],           # 6-P4/16
   [-1, 3, C3, [512]],
   [-1, 1, CBAM, [512]],               # 8-添加注意力机制
   
   [-1, 1, Conv, [1024, 3, 2]],        # 9-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],           # 11
   [-1, 1, CBAM, [1024]],              # 12-顶层注意力
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],           # 改为连接第8层(P4)
   [-1, 3, C3, [512, False]],          # 16
   
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],          # 改为连接第5层(P3)
   [-1, 3, C3, [256, False]],          # 20
   
   # ----- 新增P2处理路径 -----
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],          # 连接第2层(P2)
   [-1, 3, C3, [128, False]],          # 24
   
   # ----- 多尺度特征融合 -----
   [-1, 1, SelfAdaptiveFusion, [256]], # 25 融合不同尺度特征
   [-1, 3, C3, [256, False]],          # 26
   
   # ----- 下采样路径 -----
   [-1, 1, HighEfficiencyFeatureDownSample, [256]],  # 27-P3/8替代传统下采样
   [[-1, 26], 1, Concat, [1]],          # 与P3特征融合
   [-1, 3, C3, [512, False]],          # 29
   
   [-1, 1, HighEfficiencyFeatureDownSample, [512]],  # 30-P4/16
   [[-1, 16], 1, Concat, [1]],          # 与P4特征融合
   [-1, 3, C3, [1024, False]],         # 32
   
   # ----- 检测头 -----
   [[25, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4)
  ]